---
title: SketchFailures
classe: Autodesk.Revit.DB.BuiltInFailures+SketchFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 165
---

# SketchFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId AreaLoadNoForce { get; }` | `SketchFailures.AreaLoadNoForce` | FailureDefinitionId |
| `FailureDefinitionId AxisNotSpecified { get; }` | `SketchFailures.AxisNotSpecified` | FailureDefinitionId |
| `FailureDefinitionId BadNosingProfile { get; }` | `SketchFailures.BadNosingProfile` | FailureDefinitionId |
| `FailureDefinitionId BadRailingsProfile { get; }` | `SketchFailures.BadRailingsProfile` | FailureDefinitionId |
| `FailureDefinitionId BeamDirectionNotSpecified { get; }` | `SketchFailures.BeamDirectionNotSpecified` | FailureDefinitionId |
| `FailureDefinitionId BeamDirectionNotSpecifiedError { get; }` | `SketchFailures.BeamDirectionNotSpecifiedError` | FailureDefinitionId |
| `FailureDefinitionId BentFabricSheetClosedLoopInSketch { get; }` | `SketchFailures.BentFabricSheetClosedLoopInSketch` | FailureDefinitionId |
| `FailureDefinitionId BentFabricSheetEmptySketch { get; }` | `SketchFailures.BentFabricSheetEmptySketch` | FailureDefinitionId |
| `FailureDefinitionId BentFabricSheetInvalidElementInSketch { get; }` | `SketchFailures.BentFabricSheetInvalidElementInSketch` | FailureDefinitionId |
| `FailureDefinitionId BentFabricSheetLinesOverlapOrIntersect { get; }` | `SketchFailures.BentFabricSheetLinesOverlapOrIntersect` | FailureDefinitionId |
| `FailureDefinitionId BentFabricSheetManyLoopsInSketch { get; }` | `SketchFailures.BentFabricSheetManyLoopsInSketch` | FailureDefinitionId |
| `FailureDefinitionId BentFabricSheetTooShortSegments { get; }` | `SketchFailures.BentFabricSheetTooShortSegments` | FailureDefinitionId |
| `FailureDefinitionId BoundaryNoOverlap { get; }` | `SketchFailures.BoundaryNoOverlap` | FailureDefinitionId |
| `FailureDefinitionId BuildingPadNoSurface { get; }` | `SketchFailures.BuildingPadNoSurface` | FailureDefinitionId |
| `FailureDefinitionId BuildingPadNoSurfaceError { get; }` | `SketchFailures.BuildingPadNoSurfaceError` | FailureDefinitionId |
| `FailureDefinitionId CannotChangeUserSketchPlane { get; }` | `SketchFailures.CannotChangeUserSketchPlane` | FailureDefinitionId |
| `FailureDefinitionId CannotChangeUserSketchPlaneError { get; }` | `SketchFailures.CannotChangeUserSketchPlaneError` | FailureDefinitionId |
| `FailureDefinitionId CannotChangeWorkplaneVisibility { get; }` | `SketchFailures.CannotChangeWorkplaneVisibility` | FailureDefinitionId |
| `FailureDefinitionId CannotComputeRailingsElevation { get; }` | `SketchFailures.CannotComputeRailingsElevation` | FailureDefinitionId |
| `FailureDefinitionId CannotComputeRailingsElevationError { get; }` | `SketchFailures.CannotComputeRailingsElevationError` | FailureDefinitionId |
| `FailureDefinitionId CannotComputeRailingsElevationWarn { get; }` | `SketchFailures.CannotComputeRailingsElevationWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotConvertSketch { get; }` | `SketchFailures.CannotConvertSketch` | FailureDefinitionId |
| `FailureDefinitionId CannotDrawExtrusionRoof { get; }` | `SketchFailures.CannotDrawExtrusionRoof` | FailureDefinitionId |
| `FailureDefinitionId CannotDrawProfileRoof { get; }` | `SketchFailures.CannotDrawProfileRoof` | FailureDefinitionId |
| `FailureDefinitionId CannotGetSketchReferences { get; }` | `SketchFailures.CannotGetSketchReferences` | FailureDefinitionId |
| `FailureDefinitionId CannotHaveArcs { get; }` | `SketchFailures.CannotHaveArcs` | FailureDefinitionId |
| `FailureDefinitionId CannotHaveArcsPath3d { get; }` | `SketchFailures.CannotHaveArcsPath3d` | FailureDefinitionId |
| `FailureDefinitionId CircleMultiPlanarShapeInSketch { get; }` | `SketchFailures.CircleMultiPlanarShapeInSketch` | FailureDefinitionId |
| `FailureDefinitionId ClosedProfileRoof { get; }` | `SketchFailures.ClosedProfileRoof` | FailureDefinitionId |
| `FailureDefinitionId ConstantHeightNotParallel { get; }` | `SketchFailures.ConstantHeightNotParallel` | FailureDefinitionId |
| `FailureDefinitionId ConstantHeightNotParallelError { get; }` | `SketchFailures.ConstantHeightNotParallelError` | FailureDefinitionId |
| `FailureDefinitionId ContainedInOtherLoops { get; }` | `SketchFailures.ContainedInOtherLoops` | FailureDefinitionId |
| `FailureDefinitionId ConvertSplineToLineFailed { get; }` | `SketchFailures.ConvertSplineToLineFailed` | FailureDefinitionId |
| `FailureDefinitionId CurveFromPickedFailed { get; }` | `SketchFailures.CurveFromPickedFailed` | FailureDefinitionId |
| `FailureDefinitionId CurveIntersectsCutFace { get; }` | `SketchFailures.CurveIntersectsCutFace` | FailureDefinitionId |
| `FailureDefinitionId CurveIntersectsSplitFace { get; }` | `SketchFailures.CurveIntersectsSplitFace` | FailureDefinitionId |
| `FailureDefinitionId CurveTooShort { get; }` | `SketchFailures.CurveTooShort` | FailureDefinitionId |
| `FailureDefinitionId DifferentOffsets { get; }` | `SketchFailures.DifferentOffsets` | FailureDefinitionId |
| `FailureDefinitionId ElementsSketchTooLarge { get; }` | `SketchFailures.ElementsSketchTooLarge` | FailureDefinitionId |
| `FailureDefinitionId ElevationSketchNotAllowed { get; }` | `SketchFailures.ElevationSketchNotAllowed` | FailureDefinitionId |
| `FailureDefinitionId EndsNotOnCutFace { get; }` | `SketchFailures.EndsNotOnCutFace` | FailureDefinitionId |
| `FailureDefinitionId EndsNotOnEdge { get; }` | `SketchFailures.EndsNotOnEdge` | FailureDefinitionId |
| `FailureDefinitionId FloorCannotAddDirectionCurve { get; }` | `SketchFailures.FloorCannotAddDirectionCurve` | FailureDefinitionId |
| `FailureDefinitionId FloorCannotAddDirectionCurveError { get; }` | `SketchFailures.FloorCannotAddDirectionCurveError` | FailureDefinitionId |
| `FailureDefinitionId FloorDirectionNotSpecified { get; }` | `SketchFailures.FloorDirectionNotSpecified` | FailureDefinitionId |
| `FailureDefinitionId FloorManyDirectionCurves { get; }` | `SketchFailures.FloorManyDirectionCurves` | FailureDefinitionId |
| `FailureDefinitionId InvalidAreaLoadSketch { get; }` | `SketchFailures.InvalidAreaLoadSketch` | FailureDefinitionId |
| `FailureDefinitionId InvalidCropAreaSketch { get; }` | `SketchFailures.InvalidCropAreaSketch` | FailureDefinitionId |
| `FailureDefinitionId InvalidCropAreaSketchRegen { get; }` | `SketchFailures.InvalidCropAreaSketchRegen` | FailureDefinitionId |
| `FailureDefinitionId InvalidElevationSketch { get; }` | `SketchFailures.InvalidElevationSketch` | FailureDefinitionId |
| `FailureDefinitionId InvalidElevationSketchError { get; }` | `SketchFailures.InvalidElevationSketchError` | FailureDefinitionId |
| `FailureDefinitionId InvalidProfile { get; }` | `SketchFailures.InvalidProfile` | FailureDefinitionId |
| `FailureDefinitionId InvalidProfileError { get; }` | `SketchFailures.InvalidProfileError` | FailureDefinitionId |
| `FailureDefinitionId InvalidRoofCurveloop { get; }` | `SketchFailures.InvalidRoofCurveloop` | FailureDefinitionId |
| `FailureDefinitionId InvalidRoofCurveloopError { get; }` | `SketchFailures.InvalidRoofCurveloopError` | FailureDefinitionId |
| `FailureDefinitionId InvalidRoofCurveloopFailure { get; }` | `SketchFailures.InvalidRoofCurveloopFailure` | FailureDefinitionId |
| `FailureDefinitionId InvalidSketch { get; }` | `SketchFailures.InvalidSketch` | FailureDefinitionId |
| `FailureDefinitionId InvalidSketchError { get; }` | `SketchFailures.InvalidSketchError` | FailureDefinitionId |
| `FailureDefinitionId InvalidSketchForBuildingpad { get; }` | `SketchFailures.InvalidSketchForBuildingpad` | FailureDefinitionId |
| `FailureDefinitionId InvalidSketchForCeiling { get; }` | `SketchFailures.InvalidSketchForCeiling` | FailureDefinitionId |
| `FailureDefinitionId InvalidSketchForFloor { get; }` | `SketchFailures.InvalidSketchForFloor` | FailureDefinitionId |
| `FailureDefinitionId InvalidSketchForRoofsoffit { get; }` | `SketchFailures.InvalidSketchForRoofsoffit` | FailureDefinitionId |
| `FailureDefinitionId InvalidSketchForToposolid { get; }` | `SketchFailures.InvalidSketchForToposolid` | FailureDefinitionId |
| `FailureDefinitionId InvalidSketchPath3d { get; }` | `SketchFailures.InvalidSketchPath3d` | FailureDefinitionId |
| `FailureDefinitionId LandingNotEnoughBoundaryCurves { get; }` | `SketchFailures.LandingNotEnoughBoundaryCurves` | FailureDefinitionId |
| `FailureDefinitionId LandingTwoManyLoops { get; }` | `SketchFailures.LandingTwoManyLoops` | FailureDefinitionId |
| `FailureDefinitionId LinesOverlap { get; }` | `SketchFailures.LinesOverlap` | FailureDefinitionId |
| `FailureDefinitionId LinesOverlapError { get; }` | `SketchFailures.LinesOverlapError` | FailureDefinitionId |
| `FailureDefinitionId LinesOverlapPath3d { get; }` | `SketchFailures.LinesOverlapPath3d` | FailureDefinitionId |
| `FailureDefinitionId LoopIntersect { get; }` | `SketchFailures.LoopIntersect` | FailureDefinitionId |
| `FailureDefinitionId LoopIntersectError { get; }` | `SketchFailures.LoopIntersectError` | FailureDefinitionId |
| `FailureDefinitionId LoopIntersectPath3d { get; }` | `SketchFailures.LoopIntersectPath3d` | FailureDefinitionId |
| `FailureDefinitionId LoopsOutsideFaceSplit { get; }` | `SketchFailures.LoopsOutsideFaceSplit` | FailureDefinitionId |
| `FailureDefinitionId LoopsOutsideFaceSplitterTooShort { get; }` | `SketchFailures.LoopsOutsideFaceSplitterTooShort` | FailureDefinitionId |
| `FailureDefinitionId ManyCCWLoops { get; }` | `SketchFailures.ManyCCWLoops` | FailureDefinitionId |
| `FailureDefinitionId ManyCCWLoopsError { get; }` | `SketchFailures.ManyCCWLoopsError` | FailureDefinitionId |
| `FailureDefinitionId ManyDirectionCurves { get; }` | `SketchFailures.ManyDirectionCurves` | FailureDefinitionId |
| `FailureDefinitionId ManyDirectionCurvesError { get; }` | `SketchFailures.ManyDirectionCurvesError` | FailureDefinitionId |
| `FailureDefinitionId MissingLapInSketch { get; }` | `SketchFailures.MissingLapInSketch` | FailureDefinitionId |
| `FailureDefinitionId MoreThanOneAxis { get; }` | `SketchFailures.MoreThanOneAxis` | FailureDefinitionId |
| `FailureDefinitionId MutipleStairsPathInOneRunFailure { get; }` | `SketchFailures.MutipleStairsPathInOneRunFailure` | FailureDefinitionId |
| `FailureDefinitionId NestedLoops { get; }` | `SketchFailures.NestedLoops` | FailureDefinitionId |
| `FailureDefinitionId NoLoops { get; }` | `SketchFailures.NoLoops` | FailureDefinitionId |
| `FailureDefinitionId NoLoopsError { get; }` | `SketchFailures.NoLoopsError` | FailureDefinitionId |
| `FailureDefinitionId NoLoopsPath3d { get; }` | `SketchFailures.NoLoopsPath3d` | FailureDefinitionId |
| `FailureDefinitionId NonMonotoneRoof { get; }` | `SketchFailures.NonMonotoneRoof` | FailureDefinitionId |
| `FailureDefinitionId NoPlane { get; }` | `SketchFailures.NoPlane` | FailureDefinitionId |
| `FailureDefinitionId NotOneCCWLoop { get; }` | `SketchFailures.NotOneCCWLoop` | FailureDefinitionId |
| `FailureDefinitionId NotOneCurve { get; }` | `SketchFailures.NotOneCurve` | FailureDefinitionId |
| `FailureDefinitionId NotOneCurveError { get; }` | `SketchFailures.NotOneCurveError` | FailureDefinitionId |
| `FailureDefinitionId NotOneCurvePath3d { get; }` | `SketchFailures.NotOneCurvePath3d` | FailureDefinitionId |
| `FailureDefinitionId NotOneLoop { get; }` | `SketchFailures.NotOneLoop` | FailureDefinitionId |
| `FailureDefinitionId NotOneLoopPath3d { get; }` | `SketchFailures.NotOneLoopPath3d` | FailureDefinitionId |
| `FailureDefinitionId OpenAreaLoadLoop { get; }` | `SketchFailures.OpenAreaLoadLoop` | FailureDefinitionId |
| `FailureDefinitionId OpenLoop { get; }` | `SketchFailures.OpenLoop` | FailureDefinitionId |
| `FailureDefinitionId OpenLoopError { get; }` | `SketchFailures.OpenLoopError` | FailureDefinitionId |
| `FailureDefinitionId OpenLoopPath3d { get; }` | `SketchFailures.OpenLoopPath3d` | FailureDefinitionId |
| `FailureDefinitionId PathCannotBeClosedLoop { get; }` | `SketchFailures.PathCannotBeClosedLoop` | FailureDefinitionId |
| `FailureDefinitionId PathCannotBeClosedLoopPath3d { get; }` | `SketchFailures.PathCannotBeClosedLoopPath3d` | FailureDefinitionId |
| `FailureDefinitionId PathReinforcementClosedLoop { get; }` | `SketchFailures.PathReinforcementClosedLoop` | FailureDefinitionId |
| `FailureDefinitionId PathReinforcementEmptySketch { get; }` | `SketchFailures.PathReinforcementEmptySketch` | FailureDefinitionId |
| `FailureDefinitionId PathReinforcementManyLoops { get; }` | `SketchFailures.PathReinforcementManyLoops` | FailureDefinitionId |
| `FailureDefinitionId PlanarMultiPlanarShapeInSketch { get; }` | `SketchFailures.PlanarMultiPlanarShapeInSketch` | FailureDefinitionId |
| `FailureDefinitionId RailingDoublyConnected { get; }` | `SketchFailures.RailingDoublyConnected` | FailureDefinitionId |
| `FailureDefinitionId RailingDoublyConnectedError { get; }` | `SketchFailures.RailingDoublyConnectedError` | FailureDefinitionId |
| `FailureDefinitionId RailingNotConnected { get; }` | `SketchFailures.RailingNotConnected` | FailureDefinitionId |
| `FailureDefinitionId RailingNotConnectedError { get; }` | `SketchFailures.RailingNotConnectedError` | FailureDefinitionId |
| `FailureDefinitionId RebarEmptySketch { get; }` | `SketchFailures.RebarEmptySketch` | FailureDefinitionId |
| `FailureDefinitionId RebarEmptySketchError { get; }` | `SketchFailures.RebarEmptySketchError` | FailureDefinitionId |
| `FailureDefinitionId RebarManyLoops { get; }` | `SketchFailures.RebarManyLoops` | FailureDefinitionId |
| `FailureDefinitionId RebarManyLoopsError { get; }` | `SketchFailures.RebarManyLoopsError` | FailureDefinitionId |
| `FailureDefinitionId RebarSystemDirectionNotSpecified { get; }` | `SketchFailures.RebarSystemDirectionNotSpecified` | FailureDefinitionId |
| `FailureDefinitionId RebarSystemDirectionNotSpecifiedError { get; }` | `SketchFailures.RebarSystemDirectionNotSpecifiedError` | FailureDefinitionId |
| `FailureDefinitionId RunInvalidSketch { get; }` | `SketchFailures.RunInvalidSketch` | FailureDefinitionId |
| `FailureDefinitionId RunNotEnoughBoundaryCurves { get; }` | `SketchFailures.RunNotEnoughBoundaryCurves` | FailureDefinitionId |
| `FailureDefinitionId SculptingCurvesCannotFormClosedLoop { get; }` | `SketchFailures.SculptingCurvesCannotFormClosedLoop` | FailureDefinitionId |
| `FailureDefinitionId SculptingCurvesCrossAxis { get; }` | `SketchFailures.SculptingCurvesCrossAxis` | FailureDefinitionId |
| `FailureDefinitionId SculptingCurvesTouchAxis { get; }` | `SketchFailures.SculptingCurvesTouchAxis` | FailureDefinitionId |
| `FailureDefinitionId SculptingLoopsOnBothSidesOfAxis { get; }` | `SketchFailures.SculptingLoopsOnBothSidesOfAxis` | FailureDefinitionId |
| `FailureDefinitionId SculptingSingleLineLoopLiesOnAxis { get; }` | `SketchFailures.SculptingSingleLineLoopLiesOnAxis` | FailureDefinitionId |
| `FailureDefinitionId ShortCurveInSketch { get; }` | `SketchFailures.ShortCurveInSketch` | FailureDefinitionId |
| `FailureDefinitionId ShortCurveInSketchRoof { get; }` | `SketchFailures.ShortCurveInSketchRoof` | FailureDefinitionId |
| `FailureDefinitionId SiteCannotDrawSurfaceBoundary { get; }` | `SketchFailures.SiteCannotDrawSurfaceBoundary` | FailureDefinitionId |
| `FailureDefinitionId SketchedRunInvalidPath { get; }` | `SketchFailures.SketchedRunInvalidPath` | FailureDefinitionId |
| `FailureDefinitionId SketchedShapeNotAvailable { get; }` | `SketchFailures.SketchedShapeNotAvailable` | FailureDefinitionId |
| `FailureDefinitionId SketchFailurePlanes { get; }` | `SketchFailures.SketchFailurePlanes` | FailureDefinitionId |
| `FailureDefinitionId SketchingInTheWrongView { get; }` | `SketchFailures.SketchingInTheWrongView` | FailureDefinitionId |
| `FailureDefinitionId SketchingInWrongView { get; }` | `SketchFailures.SketchingInWrongView` | FailureDefinitionId |
| `FailureDefinitionId SketchOverconstrained { get; }` | `SketchFailures.SketchOverconstrained` | FailureDefinitionId |
| `FailureDefinitionId SketchOverconstrainedError { get; }` | `SketchFailures.SketchOverconstrainedError` | FailureDefinitionId |
| `FailureDefinitionId SketchOverconstrainedWarn { get; }` | `SketchFailures.SketchOverconstrainedWarn` | FailureDefinitionId |
| `FailureDefinitionId SketchTooLarge { get; }` | `SketchFailures.SketchTooLarge` | FailureDefinitionId |
| `FailureDefinitionId SketchWasDeleted { get; }` | `SketchFailures.SketchWasDeleted` | FailureDefinitionId |
| `FailureDefinitionId StairClosedBoundaries { get; }` | `SketchFailures.StairClosedBoundaries` | FailureDefinitionId |
| `FailureDefinitionId StairClosedBoundariesError { get; }` | `SketchFailures.StairClosedBoundariesError` | FailureDefinitionId |
| `FailureDefinitionId StairNotEnoughBoundaryCurves { get; }` | `SketchFailures.StairNotEnoughBoundaryCurves` | FailureDefinitionId |
| `FailureDefinitionId StairNotEnoughBoundaryCurvesError { get; }` | `SketchFailures.StairNotEnoughBoundaryCurvesError` | FailureDefinitionId |
| `FailureDefinitionId StairNotEnoughRiserCurves { get; }` | `SketchFailures.StairNotEnoughRiserCurves` | FailureDefinitionId |
| `FailureDefinitionId StairNotEnoughRiserCurvesError { get; }` | `SketchFailures.StairNotEnoughRiserCurvesError` | FailureDefinitionId |
| `FailureDefinitionId StairOnlyOneConnectedBoundary { get; }` | `SketchFailures.StairOnlyOneConnectedBoundary` | FailureDefinitionId |
| `FailureDefinitionId StairOnlyOneConnectedBoundaryError { get; }` | `SketchFailures.StairOnlyOneConnectedBoundaryError` | FailureDefinitionId |
| `FailureDefinitionId StairRiserDoesntIntersectBoundary { get; }` | `SketchFailures.StairRiserDoesntIntersectBoundary` | FailureDefinitionId |
| `FailureDefinitionId StairRiserDoesntIntersectBoundaryError { get; }` | `SketchFailures.StairRiserDoesntIntersectBoundaryError` | FailureDefinitionId |
| `FailureDefinitionId StairTooManyConnectedBoundaries { get; }` | `SketchFailures.StairTooManyConnectedBoundaries` | FailureDefinitionId |
| `FailureDefinitionId StairTooManyConnectedBoundariesError { get; }` | `SketchFailures.StairTooManyConnectedBoundariesError` | FailureDefinitionId |
| `FailureDefinitionId SubregionNoHostSurf { get; }` | `SketchFailures.SubregionNoHostSurf` | FailureDefinitionId |
| `FailureDefinitionId SuggestMakingFamilyNonParametric { get; }` | `SketchFailures.SuggestMakingFamilyNonParametric` | FailureDefinitionId |
| `FailureDefinitionId SuspendedSketchWarn { get; }` | `SketchFailures.SuspendedSketchWarn` | FailureDefinitionId |
| `FailureDefinitionId TooFewParamsForSketch { get; }` | `SketchFailures.TooFewParamsForSketch` | FailureDefinitionId |
| `FailureDefinitionId TooManyElementsInSketch { get; }` | `SketchFailures.TooManyElementsInSketch` | FailureDefinitionId |
| `FailureDefinitionId TooManySlopes { get; }` | `SketchFailures.TooManySlopes` | FailureDefinitionId |
| `FailureDefinitionId TooManySlopesError { get; }` | `SketchFailures.TooManySlopesError` | FailureDefinitionId |
| `FailureDefinitionId TrussClosedReference { get; }` | `SketchFailures.TrussClosedReference` | FailureDefinitionId |
| `FailureDefinitionId TrussCrossingReferences { get; }` | `SketchFailures.TrussCrossingReferences` | FailureDefinitionId |
| `FailureDefinitionId TrussMissingReference { get; }` | `SketchFailures.TrussMissingReference` | FailureDefinitionId |
| `FailureDefinitionId TrussOverlappingReference { get; }` | `SketchFailures.TrussOverlappingReference` | FailureDefinitionId |
| `FailureDefinitionId TrussSegmentedReference { get; }` | `SketchFailures.TrussSegmentedReference` | FailureDefinitionId |
| `FailureDefinitionId TrussShiftedReferences { get; }` | `SketchFailures.TrussShiftedReferences` | FailureDefinitionId |
| `FailureDefinitionId TrussSwappedReferences { get; }` | `SketchFailures.TrussSwappedReferences` | FailureDefinitionId |
| `FailureDefinitionId UnsatisfiedSupportAssocProp { get; }` | `SketchFailures.UnsatisfiedSupportAssocProp` | FailureDefinitionId |
| `FailureDefinitionId UnsatisfiedWallAssocProp { get; }` | `SketchFailures.UnsatisfiedWallAssocProp` | FailureDefinitionId |
| `FailureDefinitionId VarSketchFailure { get; }` | `SketchFailures.VarSketchFailure` | FailureDefinitionId |
| `FailureDefinitionId VarSketchInElementFailure { get; }` | `SketchFailures.VarSketchInElementFailure` | FailureDefinitionId |
| `FailureDefinitionId WrongCutBoundaryLoops { get; }` | `SketchFailures.WrongCutBoundaryLoops` | FailureDefinitionId |
| `FailureDefinitionId WrongFaceSplitterLoopTypesNum { get; }` | `SketchFailures.WrongFaceSplitterLoopTypesNum` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```